prplfoundation/prpl-hypervisor/drivers/pic32mz-ethernet-shared.c
/*
 * Copyright (c) 2016, prpl Foundation
 * 
 * Permission to use, copy, modify, and/or distribute this software for any purpose with or without 
 * fee is hereby granted, provided that the above copyright notice and this permission notice appear 
 * in all copies.
 * 
 * THE SOFTWARE IS PROVIDED "AS IS" AND THE AUTHOR DISCLAIMS ALL WARRANTIES WITH REGARD TO THIS SOFTWARE
 * INCLUDING ALL IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS. IN NO EVENT SHALL THE AUTHOR BE LIABLE 
 * FOR ANY SPECIAL, DIRECT, INDIRECT, OR CONSEQUENTIAL DAMAGES OR ANY DAMAGES WHATSOEVER RESULTING FROM 
 * LOSS OF USE, DATA OR PROFITS, WHETHER IN AN ACTION OF CONTRACT, NEGLIGENCE OR OTHER TORTIOUS ACTION, 
 * ARISING OUT OF OR IN CONNECTION WITH THE USE OR PERFORMANCE OF THIS SOFTWARE.
 * 
 * This code was written by Sergio Johann at Embedded System Group (GSE) at PUCRS/Brazil.
 * 
 */

/*
 * Network driver for the PIC32MZ internal Ethernet controller. The following
 * PHY variants are supported:
 *      SMSC LAN8720A
 *      SMSC LAN8740A
 *
 * Based on sources of Digilent deIPcK library by Keith Vogel, LiteBSD by
 * Serge Vakulenko and the PIC32 Ethernet interface reference manual.
 * 
 * 
 * 
 * This version of the PIC32mz Ethernet driver allows to share the 
 * ethernet device among several VMs. Each VM will have its own MAC 
 * address and IP address. To use/test it, you need to have the picoTCP 
 * stack running in multiple VMs. To this, follow the steps:
 * 
 * 1 - Duplicate the directory bare-metal-apps/apps/tcp-listener to tcp-listener2.
 * 2 - Inside the tcp-listener2 directory rename the file tcp-listener.c to tcp-listener2.c.
 * 3 - In the file tcp-listener2.c modify the IP address 192.168.0.2 to 192.168.0.3.
 * 4 - Use the shared-ethernet.cfg file to generete the firmware. 
 * 5 - Enable the flag CONFIG_PIC32MZ_ETHERNET_SHARED_DRV in the main Makefile.
 * 
 * If you desire more VMs sharing the Ethernet device repeate the steps above and
 * increase the NUMBER_OF_VM defined bellow. 
 */

#include <pic32mz.h>
#include <pic32mz-ethernet.h>
#include <mips_cp0.h>
#include <driver.h>
#include <hypercall_defines.h>
#include <guest_interrupts.h>
#include <tlb.h>
#include <libc.h>
#include <hal.h>
#include <scheduler.h>
#include <malloc.h>
#include <board.h>
#include <hypercall.h>
#include <interrupts.h>
#include <vcpu.h>

/* Number of VMs sharing the ethernet driver */
#define NUMBER_OF_VM		2

#define NUMBER_OF_FRAMES	10

#define MAC_ADDRESS_SIZE	6

/* List of buffers for temporary frame storage. Frames will
 * be copied here until the destination VM request it. 
 */
struct bounded_buffer{
		uint32_t used;
		uint32_t frame_size;
		uint8_t	 frame[MTU];
}b_buf[NUMBER_OF_FRAMES];

/* Define a control structure for buffer management for
 * each VM sharing the ethernet driver. 
 */
struct vm_ctrl_buffer{
	uint32_t vm_id;
	uint8_t mac[6];
	uint32_t input;
	uint32_t output;
	struct bounded_buffer *frame_list[NUMBER_OF_FRAMES];
}VMCTRLbuf[NUMBER_OF_VM];


static uint32_t receive_index = 0;
static uint32_t read_index = 0;
static uint32_t desc_offset = 0;
static uint32_t frame_size = 0;
static uint32_t read_nbytes = 0;
static uint32_t number_used_buffers = 0;

/* Each VM will receive the device address MAC plus vm_counter */
static uint32_t vm_counter = 0;

static vcpu_t* vcpu = NULL;

void ethernet_interrupt_handler(){

	fast_interrupt_delivery(vcpu);

	IFSCLR(IRQ_ETH >> 5) = (1<<25);
	
	ETHIRQCLR = ETHIRQ;
	
}

/* Each VM must call this hypercall just once to receive its MAC address. */
void en_get_mac(){
	uint8_t * mac = (uint8_t *) tlbCreateEntry((uint32_t) MoveFromPreviousGuestGPR(REG_A0), vm_in_execution->base_addr, sizeof(uint8_t) * 6, 0xf, CACHEABLE);
	memcpy(mac, eth_port.macaddr, sizeof(uint8_t) * 6);
	mac[5] += vm_counter;

	/* The buffer of each VM is identified by the last mac address octet. 
	 * The frames will be copied to the buffer based on this value.
	 */
	if(vm_counter < NUMBER_OF_VM){
		memcpy(VMCTRLbuf[vm_counter].mac, mac, MAC_ADDRESS_SIZE);
		VMCTRLbuf[vm_counter].vm_id = vcpu_in_execution->vm->id;
		vm_counter++;
	}
}    

/* Return the VM buffer index from its VM ID.*/
int32_t get_vm_buffer_pos(uint32_t id){
	uint32_t i;
	
	for(i=0; i<vm_counter; i++){
		if(VMCTRLbuf[i].vm_id == id){
			return i;
		}
	}
	return -1;
}

/* Choose the first free buffer fom the struct bounded_buffer*/
int32_t get_free_buffer(){
	uint32_t i;
	
	for(i=0; i<NUMBER_OF_FRAMES; i++){
		if(b_buf[i].used == 0){
			return i;
		}
	}
	return -1;
}

/* Verify if two MAC addresses are the same */
int32_t maccmp(uint8_t* mac1, uint8_t* mac2){
	uint32_t i;
	for(i=0; i<MAC_ADDRESS_SIZE; i++){
		if(mac1[i] != mac2[i]){
			return 0;
		}
	}
	return 1;
}

/* Check if an ethernet frame is broadcast */
uint32_t is_broadcast(uint8_t* f){
	uint8_t mac[] = {0xff, 0xff, 0xff, 0xff, 0xff, 0xff};
	
	if(maccmp(f, mac)){
		return 1;
	}
	
	return 0;
}

/* Verify who is the VM destination searching by the MAC. */
int32_t get_vm_destination(uint8_t* f){
	uint32_t i;
	for(i=0; i<vm_counter; i++){
		if(maccmp(VMCTRLbuf[i].mac, f)){
			return i;
		}
	}
	return -1;
}

void receive_frame(){
	int32_t framesz = 0;
	uint32_t j;
	uint32_t freebuf;
	uint32_t i;
    
    /* Get the guest buffer pointer */
	char* frame_ptr = (char*)MoveFromPreviousGuestGPR(REG_A0);
    
	/* Map the guest buffer */
	char* frame_ptr_mapped = (char*)tlbCreateEntry((uint32_t)frame_ptr, vm_in_execution->base_addr, MTU, 0xf, CACHEABLE);
	
	j = get_vm_buffer_pos(vcpu_in_execution->vm->id);
	if(j<0){
		/* VM not registered. Maybe forgot to call en_get_mac()?*/
		MoveToPreviousGuestGPR(REG_V0, framesz);	
		return;
	}
	
	/*Check if there is a frame available on buffer*/
	if(VMCTRLbuf[j].input != VMCTRLbuf[j].output){
		/* get frame from temporary buffer */
		framesz = VMCTRLbuf[j].frame_list[VMCTRLbuf[j].output]->frame_size;
		memcpy(frame_ptr_mapped, VMCTRLbuf[j].frame_list[VMCTRLbuf[j].output]->frame, framesz);
		VMCTRLbuf[j].frame_list[VMCTRLbuf[j].output]->used--;
		if(VMCTRLbuf[j].frame_list[VMCTRLbuf[j].output]->used == 0)
			number_used_buffers--;
		VMCTRLbuf[j].output = (VMCTRLbuf[j].output + 1) % NUMBER_OF_FRAMES;			
		MoveToPreviousGuestGPR(REG_V0, framesz);	
		return;
	}else{
		/* Read the next frame from DMA ring. */
		while(1){
			freebuf = get_free_buffer();
			if(freebuf < 0){
				/* No more free buffers, just return.*/
				MoveToPreviousGuestGPR(REG_V0, 0);
				return;
			}
			framesz = en_ll_input(b_buf[freebuf].frame);
			
			if(framesz == 0){
				/* No frames available now */
				MoveToPreviousGuestGPR(REG_V0, 0);
				return;
			}
			
			/* Check if the destination MAC is the current VM or is a broadcast frame */
			if( maccmp(b_buf[freebuf].frame, VMCTRLbuf[j].mac) || is_broadcast(b_buf[freebuf].frame)){
				
				memcpy(frame_ptr_mapped, b_buf[freebuf].frame, framesz);
				MoveToPreviousGuestGPR(REG_V0, framesz);
				
				if(is_broadcast(b_buf[freebuf].frame)){
					/* broadcast frame, must be sent for all VMs */
					b_buf[freebuf].frame_size = framesz;
					for(i=0; i<vm_counter; i++){
						if(i==j)
							continue;
							
						VMCTRLbuf[i].frame_list[VMCTRLbuf[i].input] = &b_buf[freebuf];
						b_buf[freebuf].used++;
						VMCTRLbuf[i].input = (VMCTRLbuf[i].input + 1) % NUMBER_OF_FRAMES;
					}
					number_used_buffers++;
				}
				return;
			}else {
				/* This frame is not to the current VM, put it on the destinatin VM buffer */
				i = get_vm_destination(b_buf[freebuf].frame);
				if(i<0){
					/* frame destination not on this device, just discard it */
					continue;
				}
				
				VMCTRLbuf[i].frame_list[VMCTRLbuf[i].input] = &b_buf[freebuf];
				VMCTRLbuf[i].input = (VMCTRLbuf[i].input + 1) % NUMBER_OF_FRAMES;
				
				b_buf[freebuf].used++;
				b_buf[freebuf].frame_size = framesz;
				number_used_buffers++;
			}
		}
	}
    
