prplfoundation/prpl-hypervisor/drivers/pic32mz-ethernet-shared.c
}

void send_frame(){
	/* Getting parameters from guest*/
	uint8_t *frame  = (uint8_t *)MoveFromPreviousGuestGPR(REG_A0);
	uint32_t size = MoveFromPreviousGuestGPR(REG_A1);
    
	char* frame_ptr_mapped = (char*)tlbCreateEntry((uint32_t)frame, vm_in_execution->base_addr, size, 0xf, CACHEABLE);
	uint8_t* buf = MACH_PHYS_TO_VIRT(MACH_VIRT_TO_PHYS(tx_buf));
    
	memcpy(buf,frame_ptr_mapped,size);
    
	MoveToPreviousGuestGPR(REG_V0, size);
    
	en_ll_output(buf, size);

}

/*
 * Read PHY register.
 * Return -1 when failed.
 */
static int32_t phy_read(int32_t phy_addr, int32_t reg_num, uint32_t msec)
{
	uint32_t time_start = mfc0(CP0_COUNT, 0);
	uint32_t timeout = msec * (CPU_SPEED / 2000);

	/* Clear any commands. */
	EMAC1MCMD = 0;
	while (EMAC1MIND & PIC32_EMAC1MIND_MIIMBUSY) {
		if (mfc0(CP0_COUNT, 0) - time_start > timeout) {
			return -1;
		}
	}

	EMAC1MADR = PIC32_EMAC1MADR(phy_addr, reg_num);
	EMAC1MCMDSET = PIC32_EMAC1MCMD_READ;
	delay_ms(1);

	/* Wait to finish. */
	time_start = mfc0(CP0_COUNT, 0);
	while (EMAC1MIND & PIC32_EMAC1MIND_MIIMBUSY) {
		if (mfc0(CP0_COUNT, 0) - time_start > timeout) {
			EMAC1MCMD = 0;
			return -1;
		}
	}

	EMAC1MCMD = 0;
	return EMAC1MRDD & 0xffff;
}

/*
 * Scan PHY register for expected value.
 * Return -1 when failed.
 */
static int32_t phy_scan(int32_t phy_addr, int32_t reg_num, int32_t scan_mask, int32_t expected_value, uint32_t msec)
{
	uint32_t time_start = mfc0(CP0_COUNT, 0);
	uint32_t timeout = msec * (CPU_SPEED / 2000);

	/* Clear any commands. */
	EMAC1MCMD = 0;
	while (EMAC1MIND & PIC32_EMAC1MIND_MIIMBUSY) {
		if (mfc0(CP0_COUNT, 0) - time_start > timeout) {
			return -1;
		}
	}

	/* Scan the PHY until it is ready. */
	EMAC1MADR = PIC32_EMAC1MADR(phy_addr, reg_num);
	EMAC1MCMDSET = PIC32_EMAC1MCMD_SCAN;
	delay_ms(1);

	/* Wait for it to become valid. */
	time_start = mfc0(CP0_COUNT, 0);
	while (EMAC1MIND & PIC32_EMAC1MIND_NOTVALID) {
		if (mfc0(CP0_COUNT, 0) - time_start > timeout) {
			return -1;
		}
	}

	/* Wait until we hit our mask. */
	time_start = mfc0(CP0_COUNT, 0);
	while (((EMAC1MRDD & scan_mask) == scan_mask) != expected_value) {
		if (mfc0(CP0_COUNT, 0) - time_start > timeout) {
			return -1;
		}
	}

	/* Kill the scan. */
	EMAC1MCMD = 0;
	delay_ms(1);
	time_start = mfc0(CP0_COUNT, 0);
	while (EMAC1MIND & PIC32_EMAC1MIND_MIIMBUSY) {
		if (mfc0(CP0_COUNT, 0) - time_start > timeout) {
			return -1;
		}
	}
	return 0;
}

/*
 * Write PHY register.
 * Return -1 when failed.
 */
static int32_t phy_write(int32_t phy_addr, int32_t reg_num, int32_t value, uint32_t msec)
{
	uint32_t time_start = mfc0(CP0_COUNT, 0);
	uint32_t timeout = msec * (CPU_SPEED / 2000);

	/* Clear any commands. */
	EMAC1MCMD = 0;
	while (EMAC1MIND & PIC32_EMAC1MIND_MIIMBUSY) {
		if (mfc0(CP0_COUNT, 0) - time_start > timeout) {
			return -1;
		}	
	}

	EMAC1MADR = PIC32_EMAC1MADR(phy_addr, reg_num);
	EMAC1MWTD = value;
	delay_ms(1);

	/* Wait to finish. */
	time_start = mfc0(CP0_COUNT, 0);
	while (EMAC1MIND & PIC32_EMAC1MIND_MIIMBUSY) {
		if (mfc0(CP0_COUNT, 0) - time_start > timeout) {
			return -1;
		}
	}
	return 0;
}

/*
 * Reset the PHY via MIIM interface.
 * Return -1 on failure.
 */
static int32_t phy_reset(int32_t phy_addr)
{
	int32_t advrt;
	int32_t advertise_all = PHY_ADVRT_10_HDX | PHY_ADVRT_10_FDX |
		PHY_ADVRT_100_HDX | PHY_ADVRT_100_FDX;

	/* Check ADVRT register is writable. */
	phy_write(phy_addr, PHY_ADVRT, 0, 100);
	advrt = phy_read(phy_addr, PHY_ADVRT, 1);
	if (advrt & advertise_all)
		return -1;
	phy_write(phy_addr, PHY_ADVRT, PHY_ADVRT_CSMA | advertise_all, 100);
	advrt = phy_read(phy_addr, PHY_ADVRT, 1);
	if ((advrt & advertise_all) != advertise_all)
		return -1;

	/* Send a reset to the PHY. */
	if (phy_write(phy_addr, PHY_CONTROL, PHY_CONTROL_RESET, 100) < 0)
		return -1;

	/* Wait for the reset pin to autoclear. */
	if (phy_scan(phy_addr, PHY_CONTROL, PHY_CONTROL_RESET, 0, 500) < 0)
		return -1;

	/* Advertise both 100Mbps and 10Mbps modes, full or half duplex. */
	phy_write(phy_addr, PHY_ADVRT, PHY_ADVRT_CSMA | advertise_all, 100);

	/* Restart autonegotiation. */
	phy_write(phy_addr, PHY_CONTROL, PHY_CONTROL_ANEG_EN | PHY_CONTROL_ANEG_RESTART, 100);

	return 0;
}

/*
 * Get the speed and duplex mode of LAN87x0A chip.
 */
static void phy_lan87x0a_poll(int32_t phy_addr, int32_t *speed_100, int32_t *full_duplex)
{
	/* Read 87x0A-specific register #31. */
	int32_t special = phy_read(phy_addr, 31, 1);

	if (special & PHY_LAN87x0A_AUTODONE) {
		/* Auto-negotiation is done - get the speed. */
		*speed_100 = (special & PHY_LAN87x0A_100) != 0;
		*full_duplex = (special & PHY_LAN87x0A_FDX) != 0;
	}
}

/*
 * Determine whether the link is up.
 * When up, get the speed and duplex mode.
 */
static int32_t is_phy_linked(int32_t phy_addr, int32_t *speed_100, int32_t *full_duplex)
{
	int32_t status = phy_read(phy_addr, PHY_STATUS, 1);
	if (status < 0)
		return 0;
	if (! (status & PHY_STATUS_LINK))           /* Is link up? */
		return 0;
	if (! (status & PHY_STATUS_ANEG_ACK))       /* Is auto-negotiation done? */
		return 0;

	phy_lan87x0a_poll(phy_addr, speed_100, full_duplex);

	return 1;
}

/*
 * Initialize the Ethernet Controller.
 */
static void en_setup()
{
	int32_t empty_watermark, full_watermark;

	/* Disable the ethernet interrupt. */
	IECCLR(IRQ_ETH >> 5) = 1 << (IRQ_ETH & 31);

	/* Turn the Ethernet cotroller off. */
	ETHCON1CLR = PIC32_ETHCON1_ON | PIC32_ETHCON1_RXEN | PIC32_ETHCON1_TXRTS;

	/* Wait for abort to finish. */
	while (ETHSTAT & PIC32_ETHSTAT_ETHBUSY);

	/* Clear the interrupt flag bit. */
	IFSCLR(IRQ_ETH >> 5) = 1 << (IRQ_ETH & 31);	

	/* Clear interrupts. */
	ETHIEN = 0;
	ETHIRQ = 0;

	/* Clear discriptor pointers; for now. */
	ETHTXST = 0;
	ETHRXST = 0;
	
	/* High and low watermarks. */
	empty_watermark = MTU / RX_BYTES_PER_DESC;
	full_watermark  = RX_DESCRIPTORS - (MTU * 2) / RX_BYTES_PER_DESC;
	ETHRXWM = PIC32_ETHRXWM_FWM(full_watermark) | PIC32_ETHRXWM_EWM(empty_watermark);

	/* Set RX descriptor buffer size in bytes (aligned to 16 bytes). */
	ETHCON2 = RX_BYTES_PER_DESC;

	/* Set our Rx filters. */
	ETHRXFC = PIC32_ETHRXFC_CRCOKEN |   /* enable checksum filter */
		PIC32_ETHRXFC_RUNTEN |      /* enable short packets */
		PIC32_ETHRXFC_UCEN |        /* enable unicast filter */
		PIC32_ETHRXFC_BCEN |     /* enable broadcast filter */
		PIC32_ETHRXFC_NOTMEEN;   /* enable not me unicast filter*/ 

	/* Hash table, not used. */
	ETHHT0 = 0;
	ETHHT1 = 0;

	/* Pattern match, not used. */
	ETHPMM0 = 0;
	ETHPMM1 = 0;

	/* Byte in TCP like checksum pattern calculation. */
	ETHPMCS = 0;

	/* Turn on the ethernet controller. */
	ETHCON1 = PIC32_ETHCON1_ON;
}

