prplfoundation/prpl-hypervisor/drivers/pic32mz-ethernet-shared.c
/*
 * Initialize the MAC.
 */
static void en_setup_mac()
{
	/* Reset the MAC. */
	EMAC1CFG1 = PIC32_EMAC1CFG1_SOFTRESET;
	delay_ms(1);

	/* Pull it out of reset. */
	EMAC1CFG1 = 0;
	delay_ms(1);
	EMAC1CFG1 = PIC32_EMAC1CFG1_RXENABLE |          /* Receive enable */
                PIC32_EMAC1CFG1_TXPAUSE |   /* MAC TX flow control */
                PIC32_EMAC1CFG1_RXPAUSE;    /* MAC RX flow control */

	EMAC1CFG2 = PIC32_EMAC1CFG2_PADENABLE |         /* Pad/CRC enable */
                PIC32_EMAC1CFG2_CRCENABLE | /* CRC enable */
                PIC32_EMAC1CFG2_EXCESSDFR |
                PIC32_EMAC1CFG2_AUTOPAD |
                PIC32_EMAC1CFG2_LENGTHCK;

	EMAC1MAXF = 1518;                   /* max frame size in bytes */
	EMAC1IPGR = PIC32_EMAC1IPGR(12, 18);            /* non-back-to-back interpacket gap */
	EMAC1CLRT = PIC32_EMAC1CLRT(55, 15);            /* collision window/retry limit */
}

/*
 * Initialize RMII and MIIM.
 */
static void en_setup_rmii()
{
	EMAC1SUPP = PIC32_EMAC1SUPP_RESETRMII;          /* reset RMII */
	delay_ms(1);
	EMAC1SUPP = 0;

	EMAC1MCFG = PIC32_EMAC1MCFG_RESETMGMT;          /* reset the management fuctions */
	delay_ms(1);
	EMAC1MCFG = 0;

	/* The IEEE 802.3 spec says no faster than 2.5MHz.
	* 80 / 40 = 2MHz */
	EMAC1MCFG = PIC32_EMAC1MCFG_CLKSEL_40;
}

void en_enable_interrupts() {
	uint32_t offset;
	/* Enable interrupts. */
#if 0    
	ETHIENSET = PIC32_ETHIRQ_TXBUSE |           /* Transmit Bus Error */
                PIC32_ETHIRQ_TXDONE |       /* Transmit Done */
                PIC32_ETHIRQ_TXABORT |      /* Transmit Abort */
                PIC32_ETHIRQ_RXBUSE |       /* Receive Bus Error */
                PIC32_ETHIRQ_RXDONE |       /* Receive Done */
                PIC32_ETHIRQ_RXBUFNA |      /* Receive Buffer Not Available */
                PIC32_ETHIRQ_RXOVFLW;       /* Receive FIFO Overflow */
#endif 
	offset = register_interrupt(ethernet_interrupt_handler);
	OFF(IRQ_ETH) = offset;

	INFO("Ethernet interrupt %d registered at 0x%x", IRQ_ETH, offset);
    
	ETHIENSET = PIC32_ETHIRQ_RXDONE;
    
	/* Set IPL , sub-priority 0 */
	IPCSET(38) = 0x1f00;
    
	/* Clear interrupt */
	IFSCLR(IRQ_ETH >> 5) = (1<<25);
	ETHIRQCLR = ETHIRQ;

	IECSET(IRQ_ETH >> 5) = 1 << 25;
}

/*
 * Set DMA descriptors.
 */
void en_setup_dma() {
	struct eth_port *e = &eth_port;
	int32_t i;

	/* Set Rx discriptor list.
	* All owned by the ethernet controller. */
	memset(e->rx_desc, 0, (RX_DESCRIPTORS+1) * sizeof(eth_desc_t));
	for (i=0; i<RX_DESCRIPTORS; i++) {
		DESC_SET_EOWN(&e->rx_desc[i]);
		DESC_CLEAR_NPV(&e->rx_desc[i]);
		e->rx_desc[i].paddr = MACH_VIRT_TO_PHYS(&e->rx_buf[0] + (i * RX_BYTES_PER_DESC));
	}

	/* Loop the list back to the begining.
	* This is a circular array descriptor list. */
	e->rx_desc[RX_DESCRIPTORS].hdr = MACH_VIRT_TO_PHYS(&e->rx_desc[0]);
	DESC_SET_NPV(&e->rx_desc[RX_DESCRIPTORS-1]);

	/* Set RX at the start of the list. */
	receive_index = 0;
	ETHRXST = MACH_VIRT_TO_PHYS(&e->rx_desc[0]);

	/* Set up the transmit descriptors all owned by
	* the software; clear it completely out. */
	memset(e->tx_desc, 0, (TX_DESCRIPTORS+1) * sizeof(eth_desc_t));
	ETHTXST = MACH_VIRT_TO_PHYS(&e->tx_desc[0]);
}

/*
 * ethernet low level input (receive)
 * 
 * a raw ethernet frame is fetched from the reception buffer (controlled by
 * the RX DMA) and copied to the application buffer. Warning: the application
 * buffer should be cache-coherent.
 */
int32_t en_ll_input(uint8_t *frame) {
	struct eth_port *e = &eth_port;
	uint8_t *buf = frame;
	uint16_t size;
	read_index = receive_index;
	desc_offset = 0;
	read_nbytes = 0;

	if (!e->is_up) return 0;

	if (DESC_EOWN(&e->rx_desc[receive_index])) {
		/* There are no receive descriptors to process. */
		return 0;
	}
	frame_size = DESC_FRAMESZ(&e->rx_desc[receive_index]);
	size = frame_size;

	if (frame_size == 0) return 0;

	/* make sure we own the descriptor, bad if we don't! */
	while (frame_size > 0) {
		if (DESC_EOWN(&e->rx_desc[read_index]))
		break;

		int32_t end_of_packet = DESC_EOP(&e->rx_desc[read_index]);
		uint32_t nbytes = DESC_BYTECNT(&e->rx_desc[read_index]);
		uint32_t cb     = min(nbytes - desc_offset, frame_size);

		memcpy(buf, MACH_PHYS_TO_VIRT(e->rx_desc[read_index].paddr + desc_offset), cb);
		buf         += cb;	
		desc_offset += cb;
		read_nbytes += cb;
		frame_size       -= cb;

		/* if we read the whole descriptor page */
		if (desc_offset == nbytes) {
			/* set up for the next page */
			desc_offset = 0;
			read_index = INCR_RX_INDEX(read_index);

			/* if we are done, get out */
			if (end_of_packet || read_nbytes == frame_size)
				break;
		}
	}

	/* Free the receive descriptors. */
	while (!DESC_EOWN(&e->rx_desc[receive_index])){
		int32_t end_of_packet = DESC_EOP(&e->rx_desc[receive_index]);

		DESC_SET_EOWN(&e->rx_desc[receive_index]);  /* give up ownership */
		ETHCON1SET = PIC32_ETHCON1_BUFCDEC;     /* decrement the BUFCNT */
		receive_index = INCR_RX_INDEX(receive_index);   /* check the next one */

		/* hit the end of packet */
		if (end_of_packet)
			break;
	}

	read_index = 0;
	desc_offset = 0;
	frame_size = 0;
	read_nbytes = 0;

	return size;
}

/*
 * ethernet low level output (send)
 * 
 * a raw ethernet frame is copied from the application buffer to the transmission
 * buffer by the TX DMA engine. Warning: the application buffer should be
 * cache-coherent.
 */
void en_ll_output(uint8_t *frame, uint16_t size) {
	struct eth_port *e = &eth_port;
	volatile eth_desc_t *desc = &e->tx_desc[0];
    
	if (size > 0 && size <= MTU) {
		while(ETHCON1 & PIC32_ETHCON1_TXRTS);

		desc->hdr = 0;
		desc->paddr = MACH_VIRT_TO_PHYS(frame);
		DESC_SET_BYTECNT(desc, size);
		DESC_SET_SOP(desc); /* Start of packet */
		DESC_SET_EOWN(desc);    /* Set owner */
		DESC_SET_EOP(desc); /* End of packet */

		/* Set the descriptor table to be transmitted. */
		ETHTXST = MACH_VIRT_TO_PHYS(e->tx_desc);

		/* Start transmitter. */
		ETHCON1SET = PIC32_ETHCON1_TXRTS;
    }
    
}

/*
 * ethernet watchdog
 * 
 * this routine should be called periodically (~500ms) from the application.
 * the link will be stablished and monitored by this routine (link up/down).
 * no transmission / reception will work if the link is down.
 */
void en_watchdog(void)
{
	struct eth_port *e = &eth_port;
	int32_t receiver_enabled = (ETHCON1 & PIC32_ETHCON1_RXEN);
	int32_t speed_100 = 1, full_duplex = 1;

	/* Poll whether the link is active.
	* Get speed and duplex status from the PHY. */
	e->is_up = is_phy_linked(e->phy_addr, &speed_100, &full_duplex);
    
	MoveToPreviousGuestGPR(REG_V0, e->is_up);

