prplfoundation/prpl-hypervisor/drivers/pic32mz-ethernet-shared.c
	/* Check whether RX is enabled. */
	if (e->is_up && ! receiver_enabled) {
		/* Link activated. */
		INFO("en0: link up, %s, %s duplex",
			speed_100 ? "100Mbps" : "10Mbps",
			full_duplex ? "full" : "half");

		/* Set speed. */
		if (speed_100) {
			EMAC1SUPPSET = PIC32_EMAC1SUPP_SPEEDRMII;
		} else {
			EMAC1SUPPCLR = PIC32_EMAC1SUPP_SPEEDRMII;
		}

		/* Set duplex. */
		if (full_duplex) {
			EMAC1CFG2SET = PIC32_EMAC1CFG2_FULLDPLX;
		} else {
			EMAC1CFG2CLR = PIC32_EMAC1CFG2_FULLDPLX;
		}

		/* Set gap size. */
		EMAC1IPGT = full_duplex ? 21 : 18;

		en_setup_dma();

		ETHCON1SET = PIC32_ETHCON1_RXEN;
	}
	else if (! e->is_up && receiver_enabled) {
		/* Link down. */
		INFO("en0: link down");
		ETHCON1CLR = PIC32_ETHCON1_RXEN;
		while (ETHSTAT & PIC32_ETHSTAT_RXBUSY);
	}
}

/*
 * Different devices can have different pin assignments,
 * depending on pin count and DEVCFG.FETHIO configuration setting.
 */
static void setup_signals()
{
	switch (DEVID & 0x0fffffff) {
		case 0x05104053:            /* MZ2048ECG064 */
		case 0x05109053:            /* MZ2048ECH064 */
		case 0x05131053:            /* MZ2048ECM064 */
		case 0x07203053:            /* MZ1024EFG064 */
		case 0x07204053:            /* MZ2048EFG064 */
		case 0x07208053:            /* MZ1024EFH064 */
		case 0x07209053:            /* MZ2048EFH064 */
		case 0x07230053:            /* MZ1024EFM064 */
		case 0x07231053:            /* MZ2048EFM064 */
		
			if (*(uint32_t*)_DEVCFG3 & _DEVCFG3_FETHIO) {
				/*
				* Default setup for 64-pin device.
				*/
				ANSELECLR = 1 << 4;         /* Disable analog pad on RE4 for ERXERR */
				ANSELECLR = 1 << 6;         /* Disable analog pad on RE6 for ETXD0 */
				ANSELECLR = 1 << 7;         /* Disable analog pad on RE7 for ETXD1 */
				ANSELECLR = 1 << 5;         /* Disable analog pad on RE5 for ETXEN */
				ANSELBCLR = 1 << 15;        /* Disable analog pad on RB15 for EMDC */

				LATECLR = 1 << 6; TRISECLR = 1 << 6;    /* set RE6 as output for ETXD0 */
				LATECLR = 1 << 7; TRISECLR = 1 << 7;    /* set RE7 as output for ETXD1 */
				LATECLR = 1 << 5; TRISECLR = 1 << 5;    /* set RE5 as output for ETXEN */
			} else {
				/*
				* Alternative setup for 64-pin device.
				*/
				ANSELBCLR = 1 << 15;        /* Disable analog pad on RB15 for AEMDC */

				LATFCLR = 1 << 1; TRISFCLR = 1 << 1;    /* set RF1 as output for AETXD0 */
				LATFCLR = 1 << 0; TRISFCLR = 1 << 0;    /* set RF0 as output for AETXD1 */
				LATDCLR = 1 << 2; TRISDCLR = 1 << 2;    /* set RD2 as output for AETXEN */
			}
			break;
			
		case 0x0510E053:            /* MZ2048ECG100 */
		case 0x05113053:            /* MZ2048ECH100 */
		case 0x0513B053:            /* MZ2048ECM100 */
		case 0x0720D053:            /* MZ1024EFG100 */
		case 0x0720E053:            /* MZ2048EFG100 */
		case 0x07212053:            /* MZ1024EFH100 */
		case 0x07213053:            /* MZ2048EFH100 */
		case 0x0723A053:            /* MZ1024EFM100 */
		case 0x0723B053:            /* MZ2048EFM100 */
			if (*(uint32_t*)_DEVCFG3 & _DEVCFG3_FETHIO) {
				/*
				* Default setup for 100-pin devices.
				*/
				ANSELGCLR = 1 << 9;         /* Disable analog pad on RG9 for EREFCLK */
				ANSELBCLR = 1 << 12;        /* Disable analog pad on RB12 for ERXD0 */
				ANSELBCLR = 1 << 13;        /* Disable analog pad on RB13 for ERXD1 */
				ANSELGCLR = 1 << 8;         /* Disable analog pad on RG8 for ECRSDV */
				ANSELBCLR = 1 << 11;        /* Disable analog pad on RB11 for ERXERR */

				LATFCLR = 1 << 1; TRISFCLR = 1 << 1;    /* set RF1 as output for ETXD0 */
				LATFCLR = 1 << 0; TRISFCLR = 1 << 0;    /* set RF0 as output for ETXD1 */
				LATDCLR = 1 << 2; TRISDCLR = 1 << 2;    /* set RD2 as output for ETXEN */
			} else {
				/*
				* Alternative setup for 100-pin devices.
				*/
				ANSELGCLR = 1 << 9;         /* Disable analog pad on RG9 for AEREFCLK */
				ANSELECLR = 1 << 8;         /* Disable analog pad on RE8 for AERXD0 */
				ANSELECLR = 1 << 9;         /* Disable analog pad on RE9 for AERXD1 */
				ANSELGCLR = 1 << 8;         /* Disable analog pad on RG8 for AECRSDV */
				ANSELGCLR = 1 << 15;        /* Disable analog pad on RG15 for AERXERR */
				ANSELDCLR = 1 << 14;        /* Disable analog pad on RD14 for AETXD0 */
				ANSELDCLR = 1 << 15;        /* Disable analog pad on RD15 for AETXD1 */

				LATDCLR = 1 << 14; TRISDCLR = 1 << 14;  /* set RD14 as output for AETXD0 */
				LATDCLR = 1 << 15; TRISDCLR = 1 << 15;  /* set RD15 as output for AETXD1 */
				LATACLR = 1 << 15; TRISACLR = 1 << 15;  /* set RA15 as output for AETXEN */
			}
			break;
		case 0x05118053:            /* MZ2048ECG124 */
		case 0x0511D053:            /* MZ2048ECH124 */
		case 0x05145053:            /* MZ2048ECM124 */
		case 0x07217053:            /* MZ1024EFG124 */
		case 0x07218053:            /* MZ2048EFG124 */
		case 0x0721C053:            /* MZ1024EFH124 */
		case 0x0721D053:            /* MZ2048EFH124 */
		case 0x07244053:            /* MZ1024EFM124 */
		case 0x07245053:            /* MZ2048EFM124 */
			WARNING("124-pin devices not supported yet");
			break;
		case 0x05122053:            /* MZ2048ECG144 */
		case 0x05127053:            /* MZ2048ECH144 */
		case 0x0514F053:            /* MZ2048ECM144 */
		case 0x07221053:            /* MZ1024EFG144 */
		case 0x07222053:            /* MZ2048EFG144 */
		case 0x07226053:            /* MZ1024EFH144 */
		case 0x07227053:            /* MZ2048EFH144 */
		case 0x0724E053:            /* MZ1024EFM144 */
		case 0x0724F053:            /* MZ2048EFM144 */
			/*
			* Setup for 144-pin devices.
			*/
			ANSELJCLR = 1 << 11;        /* Disable analog pad on RJ11 for EREFCLK */
			ANSELHCLR = 1 << 5;         /* Disable analog pad on RH5 for ERXD1 */
			ANSELHCLR = 1 << 4;         /* Disable analog pad on RH4 for ERXERR */
			ANSELJCLR = 1 << 8;         /* Disable analog pad on RJ8 for ETXD0 */
			ANSELJCLR = 1 << 9;         /* Disable analog pad on RJ9 for ETXD1 */

			LATJCLR = 1 << 8; TRISJCLR = 1 << 8;    /* set RJ8 as output for ETXD0 */
			LATJCLR = 1 << 9; TRISJCLR = 1 << 9;    /* set RJ9 as output for ETXD1 */
			LATDCLR = 1 << 6; TRISDCLR = 1 << 6;    /* set RD6 as output for ETXEN */
			break;
		default:
			WARNING("DEVID not recognized\n");
	}
}

static void en_init(){
	struct eth_port *e = &eth_port;
	
	memset(b_buf, 0, sizeof(b_buf));
	memset(VMCTRLbuf, 0, sizeof(VMCTRLbuf));

	/* Board-dependent initialization. */
	setup_signals();

	/* Link is down. */
	e->is_up = 0;

