prplfoundation/prpl-hypervisor/drivers/pic32mz-ethernet-shared.c
	/* As per section 35.4.10 of the Pic32 Family Ref Manual. */
	en_setup();
	en_setup_mac();
	en_setup_rmii();

	/* Auto-detect the PHY address, 0-31. */
	for (e->phy_addr=0; e->phy_addr<32; e->phy_addr++) {
		if (phy_reset(e->phy_addr) >= 0)
		break;
	}
	if (e->phy_addr >= 32) {
		ETHCON1 = 0;
		WARNING("Ethernet PHY not detected\n");
		return;
	}else{
		INFO("Ethernet PHY at %d", e->phy_addr);
	}

	/* Extract our MAC address */
	e->macaddr[0] = EMAC1SA2;
	e->macaddr[1] = EMAC1SA2 >> 8;
	e->macaddr[2] = EMAC1SA1;
	e->macaddr[3] = EMAC1SA1 >> 8;
	e->macaddr[4] = EMAC1SA0;
	e->macaddr[5] = EMAC1SA0 >> 8;

	/*
	* Interface exists: make available by filling in network interface
	* record.  System will initialize the interface when it is ready
	* to accept packets.  We get the ethernet address here.
	*/
	INFO("Ethernet interface en0: interrupt %d, MAC address %x:%x:%x:%x:%x:%x",
		IRQ_ETH, e->macaddr[0], e->macaddr[1], e->macaddr[2], e->macaddr[3], e->macaddr[4], e->macaddr[5]);

	e->phy_id = (phy_read(e->phy_addr, PHY_ID1, 1) << 16 |
		phy_read(e->phy_addr, PHY_ID2, 1)) & 0xfffffff0;
	switch (e->phy_id) {
		case PHY_ID_LAN8720A:
			INFO("Ethernet device is a SMSC LAN8720A");
			break;
		case PHY_ID_LAN8740A:
			INFO("Ethernet device is a SMSC LAN8740A");
			break;
		default:
			INFO("PHY id=%x", e->phy_id);
		break;
	}

	/* allocate buffers and change pointers from kseg0 to kseg1 (non-cachable)
	* this will make DMA buffers coherent because we avoid acessing the L1 cache. */
	e->rx_buf = MACH_PHYS_TO_VIRT(MACH_VIRT_TO_PHYS((int8_t *)malloc(RX_BYTES * sizeof(int8_t))));
	e->rx_desc = MACH_PHYS_TO_VIRT(MACH_VIRT_TO_PHYS((eth_desc_t *)malloc((RX_DESCRIPTORS+1) * sizeof(eth_desc_t))));
	e->tx_desc = MACH_PHYS_TO_VIRT(MACH_VIRT_TO_PHYS((eth_desc_t *)malloc((TX_DESCRIPTORS+1) * sizeof(eth_desc_t))));
	if (!e->rx_buf || !e->rx_desc || !e->tx_desc){
		CRITICAL("\nEthernet Driver: Out of Memory - Hypervisor Halted.");
	}
    
	if (register_hypercall(en_watchdog, HCALL_ETHERNET_WATCHDOG) < 0){
		ERROR("Error registering the HCALL_GET_VM_ID hypercall");
		return;
	}

	if (register_hypercall(en_get_mac, HCALL_ETHERNET_GET_MAC) < 0){
		ERROR("Error registering the HCALL_GET_VM_ID hypercall");
		return;
	}

	if (register_hypercall(send_frame, HCALL_ETHERNET_SEND) < 0){
		ERROR("Error registering the HCALL_GET_VM_ID hypercall");
		return;
	}

	if (register_hypercall(receive_frame, HCALL_ETHERNET_RECV) < 0){
		ERROR("Error registering the HCALL_GET_VM_ID hypercall");
		return;
	}
    
	/* check if there is a VCPU associated to ethernet interrutps. */
	vcpu = get_fast_int_vcpu_node(IRQ_ETH);
	if (vcpu){
		en_enable_interrupts();
	}

	return;
}

driver_init(en_init);
